# LDevice_DeleteAcc

## Description
Delete accessory attached to a Lighting Device.

```pascal
PROCEDURE LDevice_DeleteAcc(
				handle         : HANDLE;
				cellIndex      : LONGINT;
				accessoryIndex : LONGINT);
```

```python
def vs.LDevice_DeleteAcc(handle, cellIndex, accessoryIndex):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE|   |
|cellIndex|LONGINT|   |
|accessoryIndex|LONGINT|   |

## Version
Availability: from Vectorworks 2021

## Category
* Spotlight